# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"

    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "imageoptim" # a tool to optimize images
    cask "ghostty"
    cask "ngrok"
    cask "pearcleaner"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-fira-mono-nerd-font"
    cask "font-ia-writer-duo"
    cask "font-ia-writer-mono"
    cask "font-ia-writer-quattro"
    cask "font-iosevka-nerd-font"
    cask "font-symbols-only-nerd-font"

elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

tap "stripe/stripe-cli"

# packages
brew "abcmidi"
brew "act"
brew "asdf"
brew "atuin"
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "exa" # ls alternative
brew "fd" # find alternative
brew "flyctl"  # fly.io's cli
brew "fnm" # Fast Node version manager
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gettext"
brew "gh" # GitHub CLI
brew "ghq"
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "git-lfs"
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "just"
brew "lazygit" # a better git UI
brew "lychee"
brew "mise"
# brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "pipx" # python command runner
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "starship"
# brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
# brew "zsh" # zsh (latest)
